/******************************************************************************
文 件 名   : dht11.c

@file dht11.c
@brief DHT11驱动
******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "main.h"

#ifdef __DHT11_DEV_DRIVER__
/*----------------------------------------------*
 * 宏定义                                 *
 *----------------------------------------------*/
#define DEBUG   ( 1 )

#if DEBUG
#define log(X)    print_string(X)
#else
#define log(X)
#endif


sbit DHT11_pin = P3^7;///<定义数据引脚

#define JUDGE   ( 5 )   ///<用于判断通信的0和1，与单片机速度和晶振频率有关
/*----------------------------------------------*
 * 枚举定义                            *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 结构体定义                              *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                       *
 *----------------------------------------------*/

/*---------------------------------------------------------------------------*/
/**
*@brief 延时30us
*
*
*@param 
*
*@return 
* 
*
*@note 11.0592MHz
*
*/
static void dht11_delay30us(void)		
{
	unsigned char i;

	_nop_();
	i = 9;
	while (--i);
}
/*---------------------------------------------------------------------------*/
/**
*@brief 延时20ms
*
*
*@param 
*
*@return 
* 
*
*@note 11.0592MHz
*
*/
static void dht11_delay20ms(void)		
{
	unsigned char i, j;

	i = 35;
	j = 13;
	do
	{
		while (--j);
	} while (--i);
}
/*---------------------------------------------------------------------------*/
/**
*@brief 获取dht11温湿度数据(只获取温湿度整数部分,仿真情况下,小数部分不能显示)
*
*
*@param humidity: 湿度数据
*@param temperature: 温度数据
*
*@return 0-读取失败 1-读取成功
* 
*
*@note 经测试读取dht11的数据最小间隔为2秒
*
*/
bool dht11_read_data(uint8_t *temperature, uint8_t * humidity)		 
{
  uint8_t dat_r[5];//用于存放从DHT11读取到的数值
  uint8_t i,j;     
  uint8_t t;       //超时判断
  uint8_t dat8 = 0;//一次读取的8位数据，需要读5次

  __disable_irq();
  DHT11_pin = 0;//主机发起始信号
  dht11_delay20ms();  //主机拉低总线至少18ms
  DHT11_pin = 1;//主机拉高总线20~40us
  dht11_delay30us();

  t = 80;                 //设置超时等待时间
  while(DHT11_pin && t--);//等待DHT11拉低总线
  if(t == 0){             //超时
    DHT11_pin = 1;
    log("dht11 err1\r\n");
    return false;
  }

  //等80us响应信号
  t = 250;                  //设置超时等待时间
  while(!DHT11_pin && t--); //等待DHT11拉高总线
  if(t == 0){               //超时
    DHT11_pin = 1;
    log("dht11 err2\r\n");
    return false;
  }
  //等80us响应信号
  t = 250;                //设置超时等待时间
  while(DHT11_pin && t--);//等待DHT11拉低总线
  if(t == 0){             //超时
    DHT11_pin = 1;
    log("dht11 err3\r\n");
    return false;     
  }

  for(j = 0; j < 5; j++){//5次读取
    for(i = 0; i < 8; i++){//1次8个位
      //等待50us开始时隙
      t = 150;                 //设置超时等待时间
      while(!DHT11_pin && t--);//等待DHT11拉高总线
      if(t == 0){              //超时
        DHT11_pin = 1;
        log("dht11 err4\r\n");
        return false;                        
      }
      t = 0;                  //记录时间清零
      while(DHT11_pin && ++t);//等待并记录高电平持续时间
      dat8 <<= 1;
      if(t > JUDGE){//高电平持续时间较长(70us)
        dat8 += 1;  //传输值为1
      }                        
    }
    dat_r[j] = dat8;
    dat8 = 0;
  }

  dht11_delay30us();//等待DHT11拉低50us
  dht11_delay30us();
  DHT11_pin = 1;//结束，拉高总线
  __enable_irq();

  if(dat_r[0] == 0 && dat_r[2] == 0){
    log("dht11 err5\r\n");
    return false;
  }
  j = 0;
  for(i = 0; i < 4; i++){
    j += dat_r[i];
  }
  if(j != dat_r[4]){
    log("dht11 check err\r\n");
    return false;
  }
  *humidity = dat_r[0];
  *temperature = dat_r[2];
  return true;
}	 
/*---------------------------------------------------------------------------*/
#endif//__DHT11_DEV_DRIVER__